<script setup>
import { reactive, toRefs, onBeforeMount, onMounted } from 'vue'
  const state = reactive({})
  onBeforeMount(() => {})
  onMounted(() => {})

  const onClickLeft = () => history.back();

</script>

<template>
  <div>
    <van-nav-bar
      title="青年阳光项目"
      left-arrow
      @click-left="onClickLeft"
    />
    <div class="content">
      <div>北京站</div>
      <div>2021-02-12 16.34 发布</div>
      <div>青年兴则国家兴，青年强则国家强。青年一代有理想、有本领、有担当，国家就有前途，
        民族就有希望。关爱青年，为青年成长保驾护航，刻不容缓。浙江东岸科技有限公司作为一家以人为本的数字科技企业，
        在企业内外倡导“给人信心、给人希望、给人欢喜、给人方便”的四给理念，从公益角度提出开展“青年成长阳光工程”的建设工作。
        该工程以帮扶弱势青年为核心目标，以东岸科技在业界领先的数据平台为支撑对阶段性债务受压青年提供线上线下一体化的精准帮扶试点，
        为全社会帮扶阶段性债务受压青年起到示范引领作用。青年兴则国家兴，青年强则国家强。青年一代有理想、有本领、有担当，国家就有前途，
        民族就有希望。关爱青年，为青年成长保驾护航，刻不容缓。浙江东岸科技有限公司作为一家以人为本的数字科技企业，
        在企业内外倡导“给人信心、给人希望、给人欢喜、给人方便”的四给理念，从公益角度提出开展“青年成长阳光工程”的建设工作。
        该工程以帮扶弱势青年为核心目标，以东岸科技在业界领先的数据平台为支撑对阶段性债务受压青年提供线上线下一体化的精准帮扶试点，
        为全社会帮扶阶段性债务受压青年起到示范引领作用。青年兴则国家兴，青年强则国家强。青年一代有理想、有本领、有担当，国家就有前途，
        民族就有希望。关爱青年，为青年成长保驾护航，刻不容缓。浙江东岸科技有限公司作为一家以人为本的数字科技企业，
        在企业内外倡导“给人信心、给人希望、给人欢喜、给人方便”的四给理念，从公益角度提出开展“青年成长阳光工程”的建设工作。
        该工程以帮扶弱势青年为核心目标，以东岸科技在业界领先的数据平台为支撑对阶段性债务受压青年提供线上线下一体化的精准帮扶试点，
        为全社会帮扶阶段性债务受压青年起到示范引领作用。青年兴则国家兴，青年强则国家强。青年一代有理想、有本领、有担当，国家就有前途，
        民族就有希望。关爱青年，为青年成长保驾护航，刻不容缓。浙江东岸科技有限公司作为一家以人为本的数字科技企业，
        在企业内外倡导“给人信心、给人希望、给人欢喜、给人方便”的四给理念，从公益角度提出开展“青年成长阳光工程”的建设工作。
        该工程以帮扶弱势青年为核心目标，以东岸科技在业界领先的数据平台为支撑对阶段性债务受压青年提供线上线下一体化的精准帮扶试点，
        为全社会帮扶阶段性债务受压青年起到示范引领作用。青年兴则国家兴，青年强则国家强。青年一代有理想、有本领、有担当，国家就有前途，
        民族就有希望。关爱青年，为青年成长保驾护航，刻不容缓。浙江东岸科技有限公司作为一家以人为本的数字科技企业，
        在企业内外倡导“给人信心、给人希望、给人欢喜、给人方便”的四给理念，从公益角度提出开展“青年成长阳光工程”的建设工作。
        该工程以帮扶弱势青年为核心目标，以东岸科技在业界领先的数据平台为支撑对阶段性债务受压青年提供线上线下一体化的精准帮扶试点，
        为全社会帮扶阶段性债务受压青年起到示范引领作用。青年兴则国家兴，青年强则国家强。青年一代有理想、有本领、有担当，国家就有前途，
        民族就有希望。关爱青年，为青年成长保驾护航，刻不容缓。浙江东岸科技有限公司作为一家以人为本的数字科技企业，
        在企业内外倡导“给人信心、给人希望、给人欢喜、给人方便”的四给理念，从公益角度提出开展“青年成长阳光工程”的建设工作。
        该工程以帮扶弱势青年为核心目标，以东岸科技在业界领先的数据平台为支撑对阶段性债务受压青年提供线上线下一体化的精准帮扶试点，
        为全社会帮扶阶段性债务受压青年起到示范引领作用。青年兴则国家兴，青年强则国家强。青年一代有理想、有本领、有担当，国家就有前途，
        民族就有希望。关爱青年，为青年成长保驾护航，刻不容缓。浙江东岸科技有限公司作为一家以人为本的数字科技企业，
        在企业内外倡导“给人信心、给人希望、给人欢喜、给人方便”的四给理念，从公益角度提出开展“青年成长阳光工程”的建设工作。
        该工程以帮扶弱势青年为核心目标，以东岸科技在业界领先的数据平台为支撑对阶段性债务受压青年提供线上线下一体化的精准帮扶试点，
        为全社会帮扶阶段性债务受压青年起到示范引领作用。青年兴则国家兴，青年强则国家强。青年一代有理想、有本领、有担当，国家就有前途，
        民族就有希望。关爱青年，为青年成长保驾护航，刻不容缓。浙江东岸科技有限公司作为一家以人为本的数字科技企业，
        在企业内外倡导“给人信心、给人希望、给人欢喜、给人方便”的四给理念，从公益角度提出开展“青年成长阳光工程”的建设工作。
        该工程以帮扶弱势青年为核心目标，以东岸科技在业界领先的数据平台为支撑对阶段性债务受压青年提供线上线下一体化的精准帮扶试点，
        为全社会帮扶阶段性债务受压青年起到示范引领作用。</div>
    </div>
  </div>
</template>
<style lang="scss" scoped>

.content {
  margin: 0 auto;
  width: 636px;
  min-height: 1454px;
  overflow: scroll;
  & div:nth-child(1) {
    margin-top: 30px;
    width: 108px;
    height: 48px;
    font-size: 36px;
    font-family: PingFang-SC-Bold, PingFang-SC;
    font-weight: bold;
    color: #333333;
    line-height: 48px;
  }
  & div:nth-child(2) {
    margin-top: 10px;
    width: 258px;
    height: 33px;
    font-size: 24px;
    font-family: PingFangSC-Regular, PingFang SC;
    font-weight: 400;
    color: #999999;
    line-height: 33px;
  }
  & div:nth-child(3) {
    margin-top: 30px;
    font-size: 28px;
    font-family: PingFangSC-Regular, PingFang SC;
    font-weight: 400;
    color: #333333;
    line-height: 40px;
  }
}

:deep(.van-nav-bar__content) {
  height: 128px;
  background: #EEEEEE;
}
:deep(.van-nav-bar__title) {
  margin-left: 100px;
  height: 50px;
  font-size: 36px;
  font-family: PingFang-SC-Bold, PingFang-SC;
  font-weight: bold;
  color: #333333;
  line-height: 50px;
}
:deep(.van-nav-bar .van-icon) {
  color: #333333;;
}
:deep(.van-nav-bar__arrow) {
  font-weight: bold;
  font-size: 50px;
}
</style>